---
kind: other
id: Properties.T:Autodesk.Revit.DB.LayoutRuleFixedNumber
source: html/57a0cd1e-0f7d-c1d6-4c32-5b36d9d855ba.htm
---
# LayoutRuleFixedNumber Properties

Identifies if the object is read-only or modifiable.